# Templates (Шаблоны)

# Template — это HTML-файл с динамическими данными.
# Django использует шаблонизатор, чтобы вставлять Python-переменные в HTML.


# Связь между View и Template

# Пользователь заходит на URL.
# Django вызывает View (функцию/класс).
# View может взять данные из базы.
# View рендерит Template, подставляя данные.
# Пользователь видит HTML-страницу.



# Основные теги Django Templates

# 1. {% extends %} — наследование шаблона

# Используется, когда у нас есть общий базовый шаблон (например, base.html).
# Позволяет не копировать одинаковый HTML (header, footer).

# {% extends "base.html" %}

# Это значит:
# Этот файл использует структуру base.html.




# 2. {% block %} — блок для изменения

# В base.html создаются блоки:

# <body>
#     {% block content %}
#     {% endblock %}
# </body>

# В другом шаблоне мы можем их заполнить:

# {% block content %}
#     <h1>Главная страница</h1>
# {% endblock %}

# Block = место, которое можно заменить.




# 3. {% include %} — вставить другой файл

# Используется для подключения маленьких частей:

# navbar
# footer
# sidebar

# {% include "navbar.html" %}

# Это просто вставка другого HTML-файла.




# 4. {% load static %} — подключение статических файлов

# Нужно для CSS, JS, изображений.

# В начале файла:

# {% load static %}

# Подключение:

# <link rel="stylesheet" href="{% static 'css/style.css' %}">

# Без load static статические файлы не работают.

# 5. Переменные {{ }}

# Для вывода данных из View:

# <h1>{{ title }}</h1>
# <p>{{ user.username }}</p>

# Двойные фигурные скобки = вывести значение.

# 6. Условия {% if %}
# {% if user.is_authenticated %}
#     <p>Привет, {{ user.username }}</p>
# {% else %}
#     <p>Вы не авторизованы</p>
# {% endif %}
# 7. Цикл {% for %}
# {% for product in products %}
#     <p>{{ product.name }}</p>
# {% endfor %}
# Простое правило

# {{ }} → вывести данные

# {% %} → логика (if, for, include, extends)

# Самое главное понять

# extends — наследуем
# block — заменяем
# include — вставляем
# static — подключаем файлы







# Template Tags и Template Filters

# Когда мы пишем HTML в Django, мы можем вставлять переменные, условия, циклы и встроенные функции прямо в шаблон.
# Это делается с помощью тегов и фильтров.


# 1. Template Tags (теги шаблонов)

# Теги — это специальные команды Django, которые добавляют логику в шаблон:
# условия, циклы, подключение других файлов и т.д.

# Теги всегда пишутся в фигурных скобках и с процентами:







# 2. Template Filters (фильтры шаблонов)

# Фильтры — это функции, которые изменяют вывод переменной.
# Они пишутся через вертикальную черту |.


# {{ movie.name|upper }}



# Популярные фильтры Django:

# upper	Преобразует в верхний регистр	`{{ movie.name|
# lower	Преобразует в нижний регистр	`{{ movie.name
# title	Делает каждое слово с заглавной буквы	`{{ movie.name
# length	Возвращает длину строки или списка	`{{ movies
# default:"-"	Возвращает дефолтное значение, если пусто	`{{ movie.age_rating
# date:"d.m.Y"	Форматирует дату	`{{ movie.created_date
# truncatechars:10	Обрезает строку после 10 символов	`{{ text
# add:10	Прибавляет число	`{{ movie.raiting
# join:", "	Объединяет список через запятую	`{{ movies
# slice:":3"	Берёт первые 3 элемента	`{{ movies
# yesno:"No,Нет"	Выводит "Да"/"Нет" для True/False	`{{ movie.is_published







# 3. Пользовательские фильтры и теги

# Можно создавать свои фильтры и теги, если стандартных недостаточно.

# Пример — создадим фильтр, который делает текст с восклицанием:

# from django import template

# register = template.Library()

# @register.filter
# def excited(value):
#     return f"{value}!!!"





from catalog.models import Movie

# 3. ORM (Object-Relational Mapping)

# ORM = мост между Python-кодом и базой данных.
# Ты пишешь Movie.objects.all() → Django делает SELECT * FROM movie.
# Ты пишешь Movie.objects.create() → Django делает INSERT INTO movie....
# То есть, ORM переводит Python → SQL.


Movie.objects.all()
Movie.objects.filter(country="USA")
Movie.objects.get()
Movie.objects.first()
Movie.objects.last()
Movie.objects.count()
Movie.objects.create(name="мост в терабитию", category_id=1, directed_by="Gábor Csupó")
Movie.objects.exists()
Movie.objects.filter(country="USA").first().delete()






# 1. Получить все фильмы

# Получите все фильмы из базы данных.

# Используйте:

# all()



# 2. Только опубликованные фильмы

# Получите фильмы, у которых:

# is_published = True

# Используйте:

# filter()



# 3. Фильмы с рейтингом выше 3

# Найдите фильмы, у которых рейтинг больше 3.

# Используйте lookup:

# __gt




# 4. Фильмы из определённой категории

# Получите все фильмы категории "Комедия".

# Подсказка:
# сначала найдите категорию, потом её фильмы.



# 5. Найти фильм по названию

# Получите фильм с названием:

# "Avatar"

# Используйте:

# get()


# 6. Поиск по части названия

# Найдите фильмы, название которых содержит "ый".

# Используйте lookup:

# __icontains




# 7. Фильмы определённого режиссёра

# Найдите фильмы, у которых режиссёр:

# Nolan



# 8. Фильмы с возрастным рейтингом 18+

# Найдите фильмы, где:

# age_rating = "18+"



# 9. Фильмы из определённой страны

# Найдите фильмы из страны:

# USA



# 11. Фильмы определённого жанра

# Найдите фильмы жанра:

# Action

# Подсказка: использовать связь ManyToMany.


# 10. Фильмы с несколькими условиями

# Найдите фильмы:

# опубликованные

# рейтинг больше 3


# 12. Фильмы без страны

# Найдите фильмы, у которых country = NULL.

# Используйте lookup:

# __isnull



# Задача сложнее

# Получите фильмы:

# опубликованные

# рейтинг больше 7

# страна USA





# Что такое Git?

# Git — это система контроля версий (Version Control System).
# Она помогает программистам сохранять историю изменений в коде и работать в команде, не теряя данные.


# Простыми словами:
# Git — это как «машина времени» для твоего кода.
# Можно увидеть, кто что изменил, откатиться назад, объединить код и т.д.


# Что такое GitHub?

# GitHub — это онлайн-платформа, где хранятся ваши проекты Git.
# Это как «облако» для кода.
# Можно загружать туда свой репозиторий и делиться с другими.

# Аналогичные сайты:

# GitLab
# Bitbucket
# Gitea



# Основные команды Git

# | Команда                      | Что делает                                                |
# | ---------------------------- | --------------------------------------------------------- |
# | `git init`                   | Создаёт новый Git-репозиторий в папке                     |
# | `git status`                 | Показывает состояние проекта (изменения, новые файлы)     |
# | `git add .`                  | Добавляет все изменения в «индекс» (подготовка к коммиту) |
# | `git commit -m "текст"`      | Сохраняет изменения с комментарием                        |
# | `git log`                    | Показывает историю коммитов                               |
# | `git diff`                   | Показывает разницу между версиями файлов                  |
# | `git restore <file>`         | Отменяет изменения файла                                  |
# | `git rm <file>`              | Удаляет файл из репозитория                               |
# | `git branch`                 | Показывает список веток                                   |
# | `git checkout -b new_branch` | Создаёт и переключается на новую ветку                    |
# | `git merge branch_name`      | Объединяет другую ветку с текущей                         |
# | `git clone <url>`            | Копирует чужой репозиторий                                |
# | `git pull`                   | Забирает последние изменения с GitHub                     |
# | `git push`                   | Отправляет свои изменения на GitHub                       |





# Сигналы (Signals) — это способ сообщать другим частям программы, что произошло какое-то событие.
# Например:

# пользователь зарегистрировался → отправляем приветственное письмо
# студент удалён → удаляем его аватар из папки
# создана группа → создаём запись в статистике

# Проще говоря:
# Сигнал = событие, на которое можно “подписаться” и реагировать кодом.


# Как работают сигналы

# Есть две стороны:

# | Роль                      | Описание                                                                  |
# | ------------------------- | ------------------------------------------------------------------------- |
# | **Отправитель (Sender)**  | Модель или объект, который “посылает сигнал” (например, `Movie.save()`) |
# | **Получатель (Receiver)** | Функция, которая “слушает сигнал” и выполняет действия                    |



# Основные встроенные сигналы Django
# Сигнал	Когда срабатывает
# pre_save	Перед сохранением объекта
# post_save	После сохранения объекта
# pre_delete	Перед удалением объекта
# post_delete	После удаления объекта
# m2m_changed	При изменении связи ManyToMany
# request_started	Перед обработкой HTTP-запроса
# request_finished	После завершения запроса
# user_logged_in / user_logged_out	При входе/выходе пользователя





# Основные HTTP методы

# 1. GET

# Используется для получения данных с сервера.
# Безопасный метод: ничего не изменяет в БД.
# Данные можно передавать через query params (например: ?id=5).
# Пример: открыть страницу movies. 
# GET /movies/


# 2. POST

# Используется для создания новых данных (например, новый film).
# Данные передаются в теле запроса (формы или JSON).
# Не отображаются в адресной строке.
# Может изменять базу данных. 
# POST api/v1/movies/


# 3. PUT

# Используется для полного обновления объекта.
# Обычно в API: заменить весь объект новыми данными.
# Редко используется в HTML-формах, чаще в REST API.
# PUT /api/v1/movies/5/



# 4. PATCH

# Используется для частичного обновления объекта (обновить только одно поле).
# Более гибкий, чем PUT.
# PATCH /api/v1/movies/5/


# 5. DELETE

# Используется для удаления данных с сервера.
# Опасный метод: удаляет объект навсегда (если не реализовать "soft delete").
# DELETE /students/5


# Additional Methods ------

# 6. HEAD

# Как GET, но возвращает только заголовки, без тела.
# Используется для проверки доступности ресурса.


# 7. OPTIONS

# Запросить у сервера список доступных методов для ресурса.
# Пример: сервер может ответить, что поддерживает GET, POST, PUT, DELETE.


# GET → читать данные
# POST → создавать новые
# PUT → полностью обновить
# PATCH → частично обновить
# DELETE → удалить
# HEAD, OPTIONS → служебные




# Serializer в DRF

# Serializer — это инструмент, который превращает данные модели в JSON и обратно.

# Он делает два ключевых действия:
# serialization → из Python объекта (модели) → JSON
# deserialization → из JSON → Python объект → модель
# То есть это переводчик данных между Django и внешним миром.


# Зачем нужны сериализаторы?

# проверяют данные (валидация)
# преобразуют типы (строки → числа)
# принимают данные в POST/PUT/PATCH
# помогают сохранять объекты в БД
# возвращают данные в API ответах


# В DRF есть 2 основных типа сериализаторов:

# Serializer (ручной, полный контроль)
# ModelSerializer (автоматический, удобный)



# 1. Serializer (ручной способ)

# Это «чистый» сериализатор.
# Ты сам указываешь поля, логики сохранения, обновления и т. д.

# Используется когда:
# нет модели
# сложный custom JSON формат
# нужна полная кастомизация

# Пример


# from rest_framework import serializers

# class MovieSerializer(serializers.Serializer):
#     id = serializers.IntegerField(read_only=True)
#     title = serializers.CharField(max_length=100)
#     year = serializers.IntegerField()

#     def create(self, validated_data):
#         return Movie.objects.create(**validated_data)

#     def update(self, instance, validated_data):
#         instance.title = validated_data.get('title', instance.title)
#         instance.year = validated_data.get('year', instance.year)
#         instance.save()
#         return instance



# 2. ModelSerializer (автоматический)

# Это — упрощённая версия Serializer.
# Он смотрит на модель и сам генерирует:

# поля
# create()
# update()
# типы данных
# валидаторы


# class MovieModelSerializer(serializers.ModelSerializer):
#     class Meta:
#         model = Movie
#         fields = '__all__'



